Repository: 84000/data-translation-memory
Catalog: toh467-v3.tmx
Source language: bo
Languages: en

source: དེ་ལ་སྙིང་པོ་ཆེན་པོ་འདིས། །བདག་ཉིད་འཁོར་ལོ་རྣམ་པར་དགོད། །དེར་ནི་རང་གི་ཕྱག་རྒྱའང་བསྟེན། །
en: “Now, the great essence: “One’s own circle should be set And one should embrace their mudrā.

source: དམ་ཚིག་ཡེ་ཤེས་གཞུག་པ་སྟེ། །དེ་ལྟར་དཀྱིལ་འཁོར་བསྒྲུབ་པར་བྱ། །ཤར་དུ་དཀར་པོ་ཆེན་པོ་སྟེ། །
en: The wisdom enters the samaya— Thus should the maṇḍala be established.

source: ལྷོར་ནི་སེར་པོ་དང་ལྡན་པས། །ནུབ་ཀྱི་ཆར་ནི་དམར་པོའོ། །བྱང་དུ་ལྗང་གུ་དང་ལྡན་པར། །ཨིནྡྲ་ནཱི་ལའི་འོད་འདྲ་བའི། །དབུས་ཀྱི་ཆར་ནི་ཡང་དག་བྲི། །
en: “The east should be colored bright white, The south, yellow, The western portion, red, The north green in color, And the central space like the light of a sapphire.

source: དེ་ལ་ཕྱག་རྒྱ་དགོད་པར་བྱ། །ལས་ཀྱི་ཆོ་ག་མཐོང་ནས་ནི། །
en: “Then the implements should be placed In accordance with the prescribed rite.

source: རྟག་ཏུ་ཕྱག་རྒྱ་མཁའ་མཉམ་པ། །ཕྱག་རྒྱ་དེ་ཉིད་རྟག་ཏུ་བྲི། །
en: The implements are always sky-like And are always drawn in this way.

source: དེ་ཡི་དཀྱིལ་དུ་རྡོ་རྗེ་བྲི། །ཤར་དུ་འཁོར་ལོ་ཡང་དག་བྲི། །དེ་ལྟ་བུ་ལ་སོགས་པ་བལྟ། །
en: In the center one should draw a vajra, In the east, a wheel should be drawn, And so forth for the other directions.

source: ཕྱག་མཚན་ཀུན་ཏུ་ཞལ་དང་མཚུངས། །
en: The implements should always resemble the main face.

source: དེ་ལ་འདི་ཡི་དགང་གཟར་ནི། །
en: Now, for the ladle: “One should fashion a stick That it is one cubit in length.

source: དེ་ཡི་ཡུ་བའི་ཚད་དུ་བྱ། །ཁྲུ་གང་དང་ནི་ལྡན་པར་བྱ། །དེ་ཡི་དཀྱིལ་འཁོར་རྩེ་མོ་ནི། །སོར་བཞི་པོ་ལ་ཟླུམ་པོར་བྱ། །
en: Its end should be rounded And measure four finger-widths around.

source: གཏིང་དུ་སོར་གཉིས་ཟབ་པ་ལ། །དེ་ལ་སོར་ཕྱེད་མཆུར་བྱས་པའོ། །
en: The bottom should be two finger-widths deep And fashioned with a spout half a finger-width wide.

source: བླུགས་གཟར་པདྨའི་འདབ་འདྲ་བའི། །ཁ་ནི་མཐེ་བོའི་ལྟོ་གང་ལ། །དེ་ལ་སོར་གཅིག་ཙམ་ཟབ་པ། །རྒྱུད་འདི་རུ་ནི་རབ་ཏུ་བསྔགས། །
en: “A spoon, shaped like a lotus petal, With a bowl one thumb-width high And one finger-width deep, Is praised in this tantra.

source: དཀྱིལ་འཁོར་དུ་ནི་མ་ཞུགས་དང་། །མཚམས་མེད་ལྔ་ནི་བྱས་པ་དང་། །སེམས་ཅན་སྲོག་ནི་གཅོད་པ་དང་། །ཉ་དང་ཤ་ནི་མངོན་ཟ་དང་། །ཆང་ལ་མངོན་པར་དད་པ་དང་། །ཆད་ལྟའི་བརྟུལ་ཞུགས་འཛིན་པ་དང་། །མངོན་པར་དབང་ནི་མ་བསྐུར་དང་། །ཀུན་ཏུ་འཁྱམ་ཞིང་ལྡོམ་བུ་དང་། །གྲོང་གི་གླ་མི་བྱེད་པས་ཀྱང་། །གཤིན་རྗེའི་གཤེད་རྒྱུད་མངོན་གཞོལ་ན། །ནག་པོའི་ཚིག་ནི་ཇི་ལྟ་བར། །གྲུབ་པར་འདི་ལ་ཐེ་ཚོམ་མེད། །
en: “People who have not entered the maṇḍala, Who have committed the five acts with immediate retribution, Who have taken a life, Who eat fish and other meats, “Who indulge in wine, Who uphold the ways of nihilists, Who have not been initiated, Who wander about begging, “And who delight in country ways, And yet devote themselves to Yamāri’s tantra, Will doubtlessly become accomplished, According to words of the Dark One.”

source: དེ་ནས་བྱམས་པ་ལ་སོགས་ཀྱིས། །རྡོ་རྗེ་ངེས་པ་འདི་མཐོང་ནས། །རྡོ་རྗེ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན། །མི་སྨྲ་བར་ནི་སྡོད་པར་གྱུར། །
en: Once all the buddhas and the bodhisattvas, headed by Maitreya, heard this vajra statement, they fell silent and remained seated.

source: དེ་ལ་འདི་ནི་རྡོ་རྗེ་དབབ་པའི་ཆོ་གའོ། །འབྱུང་བཞིའི་ས་བོན་ཆེན་པོ་ཡིས། །འཁོར་ལོ་བཞི་ནི་རབ་བསྒྲུབ་བྱ། །
en: This is the rite for vajra entry: “The four circles should be formed From the great seed syllables of the four elements.

source: གནས་བཞིར་རབ་ཏུ་སྦྱོར་བ་བསམ། །ནམ་མཁའ་ལ་ནི་གཡོ་བར་བྱེད། །
en: By connecting them to the four places, One can move through the sky.

source: རྐང་པ་དག་གི་འོག་ཏུ་ཡྃ། །ལྟེ་བར་རྃ་སྟེ་སྙིང་གར་ལྃ། །མགོ་བོ་ལ་ནི་ཡི་གེ་བྃ། །
en: “The syllable yaṁ is on the bottom of the feet, the syllable raṃ is at the navel, the syllable laṃ is at the heart, and the syllable vaṃ is at the head.

source: ཡི་གེ་ཡ་ནི་ནག་ཆེན་པོ། །དྲག་ལ་རྔམ་པ་རབ་འགྱུར་བའི། །
en: “The wind maṇḍala is bow-shaped, pitch-black, The form of fierce and fearsome wind.

source: གྲུ་གསུམ་སྲེག་པའི་མེ་ལྟར་འབར། །ཉི་མའི་དཀྱིལ་འཁོར་ལྟ་བུར་དམར། །
en: The fire maṇḍala is triangular, blazes like fire, And appears as red as the sun.

source: རྡོ་རྗེ་ས་གཞི་འཛིན་བཟོད་པའི། །སེར་པོ་ཆེན་པོ་གྲུ་བཞི་པ། །
en: “The earth maṇḍala is a bright yellow square, The imperishable base of the vajra ground.

source: རི་རབ་རི་ཡིས་མནན་པ་ཡི། །ནོར་འཛིན་དེ་ནི་བསྒོམ་པར་བྱ། །
en: It should be imagined as the very earth Upon which stand Sumeru and its mountain range.

source: དཀར་པོ་ཟླུམ་པོ་བསིལ་ཆེན་པོ། །སྤྲིན་བཞིན་དུ་ནི་ཆར་བ་འཛིན། །
en: “The water maṇḍala is white, round, intensely cold, And carries water like a bank of clouds.

source: རྒྱ་མཚོ་དུ་མ་ཆུས་གང་བའི། །གངས་ཀྱི་རི་བོ་ལྟར་བསིལ་བའི། །
en: It is like the ocean filled by a thousand streams And cool like snow-covered mountains.

source: གནས་བཞི་རུ་ནི་སྦྱོར་བས་ན། །ཁར་ནི་སྣང་བ་མཐའ་ཡས་ཏེ། །སློབ་མ་རྡོ་རྗེ་བསྒོམ་པར་བྱ། །མྱུར་བ་རུ་ནི་འབེབས་པར་བྱེད། །
en: “One should visualize the vajra-holding disciple, Using the method of these four places, And with Amitābha in their mouth, And then bring them quickly into the maṇḍala.

source: དེ་ལ་འདི་ནི་སྤྲོ་བའི་ཆོ་གའོ། །རྡོ་རྗེ་ཆོས་ནི་མགོན་ཆེན་པོ། །སྣང་བ་མཐའ་ཡས་བདེ་བ་ཆེ། །
en: “This is the rite for the request: “ ‘Vajradharma, Great Protector, Amitābha, Great Bliss!

source: གསུངས་ཤིག་འདོད་ཆགས་ཆོས་ཆེན་པོ། །
en: Please speak, you who have great desire for the Dharma.

source: དགེ་དང་མི་དགེ་ལེགས་པར་དྲི། །
en: I ask about virtue and nonvirtue.’

source: ཁྲུ་གང་ནས་ནི་བརྩམས་ནས་ནི། །ཇི་སྲིད་ཁྲུ་ནི་སྟོང་གི་བར། །སློབ་མ་ཆེན་པོ་འཕར་བར་འགྱུར། །
en: “Great disciples rise up From just one cubit, Up to one thousand cubits.

source: དེ་ནི་དབབ་པའི་ཆོ་གའོ། །
en: This is based on the rite of entering.

source: འཇིགས་གཟུགས་རི་མོའི་མཚན་ཉིད་ནི། །དེ་ནས་ཡང་དག་བཤད་པར་བྱ། །
en: “Now I will explain The features of the plaster image.

source: ས་ནི་འཇམ་པོ་བླངས་བྱས་ལ། །བརྟུལ་ཞུགས་ཅན་གྱིས་བཟླས་པ་བྱ། །
en: The vow holder should take wet clay And perform the mantra recitation.

source: སྲན་གྲེའུ་འོ་མ་དེ་བཞིན་ཤ །བུ་རམ་ཏིན་ནི་ནི་ལ་སོགས། །སྣུམ་དང་ནིམ་པའི་འོ་མ་དང་། །ན་ཏི་དེ་བཞིན་ཛ་གེ་སར། །
en: “Beans, milk, meat, and molasses, Should be mixed with tamarind and the like, With oil, neem leaves, As well as nāḍīka seeds.

source: དང་པོར་དཀར་པོར་བྲི་བར་བྱ། །ཁ་དོག་གཞན་གྱིས་དེ་ནས་བསྒོམ། །
en: “One should first apply a white layer And then decorate it with other colors.

source: རྡོ་རྒྱུས་དང་ནི་བཙག་དག་ལས། །རྒྱ་སྐྱེགས་ལྟ་བུའི་མདོག་ཏུ་འགྱུར། །
en: Using chalk and red ocher Results in a color similar to lac.

source: ཡུང་བ་དེ་དང་རམས་དག་ལས། །དེ་བཞིན་ཁ་དོག་ལྗང་གུར་འགྱུར། །
en: “Turmeric and indigo Similarly yield dark green.

source: སྔོན་པོ་དག་ནི་རམས་ཀྱིས་བྱ། །དེ་བཞིན་དུ་བས་ནག་པོའོ། །
en: Blue mixed with indigo, Or with eye black, yields black.

source: ལྡོང་རོས་ཀྱིས་ནི་སེར་པོ་སྟེ། །དམར་པོ་དེ་བཞིན་མཚལ་གྱིས་སོ། །
en: “Mixing pale yellow with realgar, Or vermillion, yields red.

source: དེ་ལ་བིལ་བའི་སྙིང་པོ་བཞག །ཧ་ཅང་ཉུང་དང་མང་བ་མིན། །
en: Add to that a drop of bilva, But just a little, not too much.

source: མང་ན་ནག་པོར་འགྱུར་བ་སྟེ། །ཉུང་ན་དེ་བཞིན་འཐུལ་བར་འགྱུར། །
en: “If one adds too much it turns black, If too little, it becomes grey.

source: གཟུགས་ནི་ཁྲོ་དང་ཞི་བའོ། །
en: The image can be either wrathful or peaceful.

source: མཚན་ཉིད་དག་ནི་བཤད་པར་བྱ། །
en: The characteristics of both will now be described.

source: རོལ་བ་ཞི་བར་གསུངས་པ་སྟེ། །ཁྲོ་བོ་སྦོམ་ལ་ཐུང་བར་བཤད། །
en: “The peaceful is described as playful, The wrathful as rotund and short.

source: སྣ་ནི་སོར་བཞི་བྱ་བ་སྟེ། །
en: Its nose should measure four finger-widths.

source: དཔྲལ་བ་ཀོས་ཀོ་མཆུ་དེ་བཞིན། །མགྲིན་པ་འགྲམ་པ་དེ་བཞིན་མཚན། །སོར་བཞི་དག་ཏུ་བྱ་བ་ཡིན། །
en: Its forehead, chin, jaws, throat, and neck, Should also be four finger-widths.

source: ཉི་ཤུ་རྩ་བཞི་ལག་པ་ལ། །གྱེན་དུ་སོར་ནི་ཉི་ཤུ་ཡིན། །
en: The image should be twenty-four cubits and twenty finger-widths tall.

source: ལག་པ་རྐང་པ་གདོང་ཇི་ལྟར། །
en: Its hands, feet and mouth are all the same size.

source: མིག་ནི་མཐེ་བོང་གང་ཙམ་སྟེ། །
en: And its eyes are a single thumb width.

source: རྣ་བ་གཉིས་ལ་སོར་གཉིས་བསྒྲགས། །འབྲས་བུ་གཉིས་ལ་དེ་བཞིན་བཞི། །
en: “Its ears are described as two finger-widths And its two testicles each four.

source: མཆུ་ནི་སོར་གཉིས་བསྡོམས་པའོ། །ལྟེ་བ་སོར་གཅིག་ཟབ་པ་ཡིན། །ལུས་ནི་མགྲིན་པ་བོར་བ་ཡི། །
en: Its lips together are two finger-widths And its navel one finger-width.

source: གདོང་ནི་གསུམ་འགྱུར་ལུས་ལ་དགོད། །རལ་པ་ཅོད་པན་དེ་ཡི་ཚད། །
en: “Its face is one of third its body And has no neck.

source: རིན་ཆེན་ཅོད་པན་སོར་དྲུག་པའོ། །
en: Its crown of matted hair is the length of its face And bears a crown that is six finger-widths.

source: རལ་པ་གཅིག་མ་རབ་སྒྲུབ་ཐབས། །དེ་ནས་ཡང་དག་བཤད་བྱ་བ། །
en: “Now I will explain The practice of Ekajaṭā.

source: གནོད་སྦྱིན་མོ་ནི་སྒྲུབ་འདོད་པས། །རལ་པ་གཅིག་མ་རབ་སྒྲུབ་ཐབས། །
en: One who seeks the siddhis of a yakṣiṇī Should train in Ekajaṭā.

source: ཕྱག་གཉིས་པ་ལ་ཞལ་གཅིག་སྟེ། །གྲི་གུག་དང་ནི་ཐོད་པ་ལ། །ཤིན་ཏུ་སྦོམ་ལ་མདོག་སྔོ་བ། །དཀྱིལ་འཁོར་དབུས་སུ་བསྒོམ་པར་བྱ། །
en: “One should visualize her in the maṇḍala’s center, With one face and two arms, Holding a knife and a skull cup, Her body stout and blue.

source: ཛམྦྷ་ལ་ནི་ཤར་དུ་བསྒོམ། །བ་སུ་དྷ་ར་ལྷོ་ཕྱོགས་སུ། །
en: “Jambhalā should be imagined in the east And Vasudhārā in the south.

source: ཆུ་དབང་ནུབ་ཏུ་དགོད་པར་བྱ། །
en: Jalendrā is to be placed in the west And Cibikuṇḍalī in the north.

source: བྱང་དུ་རྣ་ཆ་ཀོས་ཀོ་འཕྱང་། །མེ་ལ་སོགས་པའི་མཚམས་དག་ཏུ། །གནོད་སྦྱིན་མོ་བཞི་རབ་བསྒོམ་བྱ། །ཀུ་ཏལ་ཀྱེ་ཧེ་ནི་གྱི་ཧྃ། །
en: “In the four corners, the southeast first, One should visualize the four yakṣiṇīs— Kuntalā, Dehinī, Gehā, and Vasundarī, And arrange them according to the rite.

source: བ་སུ་དྷ་རི་ཆོ་ག་བཞིན་དགོད། །དེར་ནི་སྒོ་བ་རྣམ་བསྒོམས་ཏེ། །ཐོ་བ་ལ་སོགས་མཉམ་པར་རོ། །
en: “One should then visualize the doors, With Mudgara and the rest all around.

source: འཁོར་ལོ་སྔ་མ་མཐོང་བ་བཞིན། །དེ་བཞིན་མདོག་ནི་རབ་སྦྱར་བྱ། །
en: One should use the same colors As in the previous maṇḍala.

source: ཕྱག་མཚན་བདག་ནི་ལྟར་འཛིན་པ། །མཁས་པས་ཕྱི་ནས་སྔགས་བཟླས་ཏེ། །ཨོཾ་ཨེ་ཀ་ཛཊཱི་བ་སུདྷཱ་རི་ཎི་སྭཱ་ཧཱ། །པུཀྐ་སཱི་ནི་རབ་སྒྲུབ་ཐབས། །དེ་ནས་ཡང་དག་བཤད་པར་བྱ། །
en: “Seeing themselves as the maṇḍala deity, bearing emblems, The adept should then recite her mantra: oṁ ekajaṭi vasudhāriṇi svāhā | “Next, I will explain The practice of Pukkasī.

source: གང་ཞིག་བསྒོམས་པ་ཙམ་གྱིས་ནི། །འཇིག་རྟེན་གསུམ་ལ་འཚེ་ནུས་པ། །
en: By merely visualizing her One is able to harm the three worlds.

source: སྐུ་མདོག་སེར་པོ་ཞལ་བཞི་པ། །ཕྱག་བཞི་བོང་བུ་ལ་བཅིབས་པ། །
en: “One should imagine her As yellow, with four faces and arms, And riding on a donkey.

source: པུཀྐ་སཱི་ཡི་ལུས་བསྒོམ་བྱ། །ཞགས་པ་ཐོ་བ་མདའ་དག་དང་། །བརྟུལ་ཞུགས་ཅན་གྱིས་གཞུ་བཅས་བསྒོམ། །
en: She should be visualized holding a bow, Noose, hammer, and arrow.

source: ཨོཾ་པུཀྐ་སཱི་ཨཾ་ཞེས་སྔགས་བརྗོད་དོ། །འཇམ་པའི་རྡོ་རྗེའི་དཀྱིལ་འཁོར་ནི། །དེ་ནས་ཡང་དག་བཤད་བྱ་བ། །
en: “The mantra to recite is: oṁ pukkasī aṃ | “Now I will explain The maṇḍala of Mañjuvajra.

source: དེ་ཡི་མོད་ལ་མི་སྣང་བར། །འཇམ་པའི་རྡོ་རྗེ་གྲགས་འགྱུར་བ། །
en: Once Mañjuvajra is accomplished, Invisibility instantly ensues.

source: འབར་བའི་གསེར་འོད་འདྲ་བ་ཡི། །སེར་པོ་ཞལ་གསུམ་ཕྱག་དྲུག་པ། །
en: “He has three faces and six arms, And is yellow, like the luster of gold.

source: གཞོན་ནུའི་གཟུགས་ནི་འཛིན་པའི་མགོན། །མི་མཐོང་བྱ་བའི་དོན་དུ་བསྒོམ། །
en: One should train in this protector with a youthful form In order to make oneself invisible.

source: ཤར་དུ་མཛེས་མ་དགོད་པར་བྱ། །དེ་བཞིན་ལྷོ་རུ་སྐྲ་ཅན་མ། །
en: “Sundarī should be placed in the east And Keśinī in the south.

source: ནུབ་ཏུ་སེར་པོ་བསྒོམ་པར་བྱ། །བྱང་དུ་ཉེ་བའི་སྐྲ་ཅན་མ། །
en: Vihvalā should be imagined in the west And Upakeśinī in the north.

source: ཐམས་ཅད་ཕྱག་ན་རལ་གྲི་དང་། །འཁོར་ལོ་ལ་སོགས་གཞན་ལ་དགོད། །
en: “A sword should be placed in their right hands And a wheel and the rest in all the others.

source: ཐམས་ཅད་ཞལ་གསུམ་ཕྱག་དྲུག་པ། །སྣ་ཚོགས་རྒྱན་གྱིས་བརྒྱན་པའོ། །
en: They all have three faces and six arms And are adorned with various ornaments.

source: ས་བོན་ཡི་གེ་མཾ་ལས་བྱུང་། །དཀྱིལ་འཁོར་གྱི་ནི་དབུས་ན་བཞུགས། །ཐམས་ཅད་ཞབས་ནི་གཡོན་བརྐྱང་བས། །རི་བོང་ཅན་གྱི་གདན་ལ་བཞུགས། །
en: “Arising from the seed syllable maṁ, They stand in the maṇḍala’s core, All standing on moon disks With their left legs extended.

source: འོད་ཟེར་ཅན་དང་རི་ཁྲོད་མ། །དེ་བཞིན་ནོར་འཛིན་སྐུལ་བྱེད་མ། །མེ་ལ་སོགས་པའི་མཚམས་བཞི་རུ། །བསྡུས་པ་དགོད་བྱ་སྙིང་པོ་ལའོ། །
en: “Mārīcī, Parṇaśabarī, Vasudhārā, and Cundrikā Are placed in the four corners, southeast first, As a gathering of the essence.

source: མྱ་ངན་མེད་དང་ཡལ་འདབ་དང་། །འབྲས་ཀྱི་སྙེ་མ་དབྱིག་པའོ། །
en: “They are visualized holding aśoka leaves and branches, As well as the stalks of clusters of grain.

source: སེར་དང་ལྗང་དང་ཡང་སེར་པོ། །དཀར་པོའི་ལུས་ནི་བསྒོམ་པར་བྱ། །
en: Their bodies are yellow and green, Yellow again, and white.

source: ཀུན་ཀྱང་ཞལ་གསུམ་ཕྱག་དྲུག་པ། །དཀྱིལ་འཁོར་དག་ཏུ་གདབ་པར་བྱ། །
en: “They all have three faces and six arms, And are known as the maṇḍala deities.

source: ཐོ་བ་ལ་སོགས་སྒོ་བ་བཞི། །
en: Mudga and the rest are visualized in the doors.

source: བསྒོམས་ན་མཐོང་བར་མི་འགྱུར་རོ། །
en: Thus will one become invisible.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུ་གསུང་ཐུགས་གཤིན་རྗེའི་གཤེད་ནག་པོའི་རྒྱུད་ལས་འཇམ་པའི་རྡོ་རྗེ་སྒྲུབ་པའི་ཐབས་ཞེས་བྱ་སྟེ་རིམ་པར་ཕྱེ་བ་བཅུ་བཞི་པའོ།། །།
en: This was the fourteenth chapter, “The Practice of Mañjuvajra,” from The Tantra of Black Yamāri, the Body, Speech, and Mind of All Tathāgatas.

source: འཕགས་པ་ཛི་གུ་ལིའི་སྒྲུབ་ཐབས། །དེ་ནས་ཡང་དག་བཤད་པར་བྱ། །
en: Chapter 15: The Practice of Vajrānaṅga “Next, I will explain The practice of the noble Jāṅgulī.

source: གང་ཞིག་བསྒོམ་པ་ཙམ་གྱིས་ནི། །ཆུ་ཡི་སྟེང་ནས་འགྲོ་འགྱུར་བ། །
en: One can walk on water Merely by visualizing her.

source: སེར་པོ་ཞལ་གསུམ་ཕྱག་དྲུག་པ། །ས་བོན་ཕུཿལས་ཡང་དག་བྱུང་། །
en: “Born from the seed syllable phuḥ, She is yellow, with three faces and six arms.

source: སྐུ་ཆེན་ཕྱག་ན་སྦྲུལ་བསྣམས་པ། །རྨ་བྱ་ལ་ནི་ཞོན་པ་དགོད། །
en: Mighty in form, she holds a snake in her hand And rides a peacock as her mount.

source: ཤར་དུ་རྨ་བྱ་དགོད་པར་བྱ། །དེ་བཞིན་ལྷོ་རུ་ཁྲོ་གཉེར་ཅན། །ནུབ་ཏུ་རི་ཁྲོད་ལོ་མ་ཅན། །བྱང་དུ་རྡོ་རྗེ་ལྕགས་སྒྲོག་མ། །
en: “One should place Māyūrī in the east, Bhṛkuṭī in the south, Parṇaśabarī in the west, And Vajraśṛṅkhalā in the north.

source: རྨ་བྱའི་སྒྲོ་དང་སྤྱི་བླུགས་དང་། །ལོ་མ་དང་ནི་ལྕགས་སྒྲོག་མ། །
en: “They should be visualized with peacock feathers, Water pitchers, sprigs, and vajra chains.

source: དེ་དག་རྣམ་པར་བསྒོམ་པར་བྱ། །སེར་དང་དམར་དང་དེ་བཞིན་ལྗང་། །ཁ་དོག་སྔོན་པོ་དབྱེ་བ་ཉིད། །
en: Their colors are yellow, red, Green, and blue, respectively.

source: མཁས་པས་འདི་ལྟར་བསྒོམ་པར་བྱ། །དེ་བཞིན་སྔགས་འདི་དག་ཀྱང་བཟླས། །ཨོཾ་ཕུཿཛཿ། ཐོ་བ་ལ་སོགས་སྒོ་རུ་དགོད། །མེ་ཏོག་ལ་སོགས་མཚམས་སུ་དགོད། །
en: “The adept should visualize in this way And then recite her mantra: oṁ phuḥ jaḥ | “Mudgara and the others are placed in the doors, And Puṣpā and the others in the corners.

source: ཛྃ་གུ་ལི་ཡི་སྦྱོར་བ་ཡིས། །ཆུ་ཡི་སྟེང་ནས་རྟག་ཏུ་འགྲོ། །
en: Through the yoga of Jāṅgulī, One will always walk on water.

source: ཀུ་རུ་ཀུལླེ་རབ་སྒྲུབ་ཐབས། །དེ་ནས་ཡང་དག་བཤད་པར་བྱ། །
en: “Next, I will explain The practice of Kurukullā.

source: གང་གིས་བསྒོམས་པ་ཙམ་གྱིས་ནི། །ཀླུ་ཡི་བུ་མོ་རབ་འགུགས་པ། །
en: Merely by visualizing her One can summon a female nāga.

source: ཁ་དོག་དམར་པོ་ཞལ་བཞི་པ། །ཕྱག་བརྒྱད་དང་ནི་རབ་ཏུ་ལྡན། །
en: “She is red, has four faces, And is arrayed with eight arms.

source: ཧྲཱིཿཡི་ས་བོན་ལས་བྱུང་བས། །ཀླུ་ནི་འགུགས་པར་བྱེད་པ་ཡིན། །
en: She arises from the syllable hrīḥ And is capable of summoning nāgas.

source: ཕྱག་བརྒྱད་དུ་ནི་ཀླུ་དགོད་དེ། །མཐའ་ཡས་ལ་སོགས་ཀླུ་རིགས་བརྒྱད། །
en: “Nāgas from the eight families, Ananta first, Should be placed in her eight hands.

source: ལུས་ནི་སྦྲུལ་གྱིས་རབ་ཏུ་བརྒྱན། །བརྟུལ་ཞུགས་ཅན་གྱིས་མཛེས་མ་བསྒོམ། །
en: The vow holder should imagine her graceful body To be beautifully adorned with snakes.

source: སྔགས་ནི་ཨོཾ་ཀུ་རུ་ཀུལླེ་ཧྲཱིཿཕུཿསྭཱ་ཧཱ། དེ་ནས་གསང་བ་བཤད་པར་བྱ། །བསྡུས་ནས་ཡིན་གྱི་རྒྱས་པ་མིན། །
en: “The mantra is: oṁ kurukulle hrīḥ phuḥ svāhā | “Now I will relate the secret, In brief, not extensively.

source: གང་ཞིག་ཤེས་པ་ཙམ་གྱིས་ནི། །ལྷ་ཡི་བུ་མོ་འགུགས་བྱེད་པ། །
en: Merely knowing it enables one To summon Apsarases.

source: ཕྱག་གཉིས་པ་ལ་ཞལ་གཅིག་སྟེ། །ཕྱག་ན་མདའ་དང་གཞུ་བསྣམས་པ། །
en: “One should visualize Vajrānaṅga With two arms and one face, And an arrow and a bow in hand.

source: ལུས་ནི་སེར་པོ་ཆེན་པོ་ཡི། །རྡོ་རྗེ་ལུས་མེད་བསྒོམ་པར་བྱ། །
en: His mighty body is yellow in color.

source: ཤར་དུ་དགའ་མ་བསྒོམ་པར་བྱ། །ལྷོ་རུ་འདོད་པས་མཛེས་མ་བསྒོམ། །ནུབ་ཏུ་འདོད་པའི་ལྷ་མོ་བསྒོམ། །བྱང་དུ་འདོད་པའི་ལྕགས་ཀྱུའོ། །
en: “Rati should be visualized in the east, Madanasundarī in the south, Kāmadevī in the west, And Madanotsukā in the north.

source: འདོད་པའི་ལྷ་མོ་ཐམས་ཅད་ཀྱི། །ཕྱག་ཏུ་མདའ་དང་གཞུ་བསྒོམ་བྱ། །སེར་དང་དམར་དང་དེ་བཞིན་ལྗང་། །དམར་སྐྱ་དག་ནི་བསྒོམ་པར་བྱ། །
en: “All of these love goddesses Should be imagined holding a bow and arrow And visualized as yellow, Red, green, and pink.

source: མཚམས་རྣམས་སུ་ནི་རྟག་དགོད་པ། །མི་འགག་དེ་བཞིན་མཚམས་ཀྱི་བདག །གཡི་དང་སྤྲེའུའི་རྒྱལ་མཚན་ནི། །
en: “Aniruddha and Uṣāpati Are always placed in the corners.

source: སྒོ་ཡི་ཕྱོགས་ཀྱི་བཤད་པར་བྱ། །འདོད་པ་འགྱིང་དང་འགྱིང་བག་ཅན། །
en: Vasanta and Makaraketu Are said to be in the doors.

source: དྲན་དང་དེ་བཞིན་མདའ་གྲི་ཅན། །ལྷ་རྣམས་དེ་དག་ཐམས་ཅད་ཀྱི། །དབུ་ལ་གཤིན་རྗེའི་གཤེད་པོ་བསྒོམ། །
en: “Yama’s slayer should be visualized On the heads of all the deities Kandarpa and Darpaka, Smara, and Bāṇāyudha.

source: བུད་མེད་ཀྱི་ནི་པདྨ་རུ། །རྡོ་རྗེ་ལུས་མེད་བསྒོམ་པར་བྱ། །
en: “Vajrānaṅga should be visualized Standing inside a woman’s lotus.

source: ཡི་གེ་ཧྲཱིཿལས་ཡང་དག་བྱུང་། །ཀུན་ཏུ་འཁོར་བར་རྣམ་པར་འཕྲོ། །
en: Arisen from the syllable śīt He emits light in all directions.

source: བསླུས་ཤིང་གཡེངས་པ་བསྒོམ་པར་བྱ། །མྱོས་ནས་བདེ་བའི་འདོད་ཡིད་ཀྱིས། །དམར་པོའི་གོས་ཀྱིས་ཡོངས་དཀྲིས་ཏེ། །རྐང་པའི་དྲུང་དུ་ལྷུང་བར་འགྱུར། །
en: “One should imagine the desired woman Trembling, beside herself with anxious desire, She has fallen at one’s feet, Wrapped in a red garment.

source: དེར་ནི་སྔགས་ཀྱང་བཟླས་པར་བྱ། །ཡི་གེ་ཨོཾ་ནི་རིང་པོར་དྲང་། །ཡི་གེ་སྭཱ་ཧཱ་མཐའ་མར་སྦྱིན། །ཡི་གེ་སི་ཏིའི་སྔགས་བཟླས་བྱ། །
en: “This is the moment to recite the mantra, Pronouncing the mantra-syllable śīt Extending from the syllable oṁ, With svāhā placed at the end.

source: ཆེ་གེ་མོ་ཞིག་བདག་དབང་འགྱུར། །ཐམས་ཅད་དུ་ནི་བསྒོམས་བྱས་ན། །ནག་པོའི་ཚིག་ནི་ཇི་བཞིན་གྱིས། །རྣལ་འབྱོར་འདོད་པས་དེ་འཐོབ་འགྱུར། །
en: “If one continuously meditates, ‘May the woman so-and-so be enthralled,’ The yogin will obtain her through desire, Just as the Dark One declared.”

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུ་གསུང་ཐུགས་གཤིན་རྗེའི་གཤེད་ནག་པོའི་རྒྱུད་ལས་ལུས་མེད་རྡོ་རྗེའི་སྒྲུབ་ཐབས་རིམ་པར་ཕྱེ་བ་སྟེ་བཅྭ་ལྔ་པའོ།། །།
en: This was the fifteenth chapter, “The Practice of Vajrānaṅga,” from The Tantra of Black Yamāri, the Body, Speech, and Mind of All Tathāgatas.

source: ཧེ་རུ་ཀ་ཆེན་སྒྲུབ་པའི་ཐབས། །དེ་ནས་ཡང་དག་བཤད་པར་བྱ། །རྣལ་འབྱོར་འཁོར་བར་བཅིངས་པ་ལ། །གང་ཞིག་ཤེས་པས་མྱུར་གྲོལ་བ། །
en: Chapter 16: The Practice of Heruka “Next, I will explain The practice of the great Heruka, Knowing which, the yogin Will quickly be liberated from saṃsāra’s fetters.

source: ཕྱག་གཉིས་པ་ལ་ཞལ་གཅིག་སྟེ། །ཁ་དོག་སྔོན་པོ་ཕྱེད་གར་ཅན། །
en: “One should visualize him with two arms and one face, Blue in color, and in the half-dancing posture.

source: རྡོ་རྗེ་ཕྱག་ཏུ་བསྒོམ་པར་བྱ། །གཞན་ཡང་ཐོད་པ་བསྒོམ་པར་བྱ། །
en: He should be visualized with a vajra in one hand And a skull cup in the other.

source: སྤྱན་གསུམ་སྐྲ་ནི་གྱེན་དུ་འགྲེང་། །ཕྱག་རྒྱ་ལྔ་ཡིས་རྣམ་པར་བརྒྱན། །
en: “He has three eyes, his hair flows upward, And he is adorned with the five mudrās.

source: ཁ་ཊྭཱྃ་ག་ནི་གཡོན་ཕྱོགས་སུ། །ཕྲེང་བ་དག་གིས་རྐང་པ་བརྒྱན། །
en: He has a khaṭvāṅga at his left side And his feet are adorned with anklets.

source: ས་བོན་ཧཱུྃ་ལས་ཡང་དག་བྱུང་། །ཡི་དགས་ལ་གནས་རྟག་ཏུ་དགོད། །
en: “He has emerged from the syllable hūṁ And should always be placed standing on a preta.

source: སངས་རྒྱས་ལྔ་རུ་རབ་སྦྱོར་བ། །ཐོད་པ་ལྔ་ནི་དབུ་ལའོ། །
en: The five skulls on his head Are related to the five buddhas.

source: ཅོད་པན་ལ་ནི་མི་བསྐྱོད་བསྒོམ། །ཧེ་རུ་ཀར་གྲགས་བསྒོམ་པར་བྱ། །
en: One should visualize Akṣobhya on their crown— This is how one visualizes the one called Heruka.

source: ཤར་དུ་ཆོས་ཀྱི་འཁོར་ལོ་མ། །སངས་རྒྱས་བྱང་ཆུབ་ལྷོ་རུའོ། །འདོད་པ་ཀུན་གྱི་འཁྲིས་མ་ནུབ། །བྱང་དུ་ཧེ་རུ་ཀ་ཉིད་འདྲ། །
en: “In the east is Dharmacakrā, In the south, Buddhabodhi, In the west, Sarvakāmalatā, And in the north, the one resembling Heruka.

source: རྒྱན་ཀུན་གྱིས་ནི་རྣམ་བརྒྱན་པའི། །ཁ་དོག་སྣ་ཚོགས་རྣམ་པར་དགོད། །
en: “They are adorned with every ornament And are arrayed in their respective colors.

source: གཟུགས་མཛེས་ཡི་དགས་ལ་བཞུགས་པ། །གཏི་མུག་ཐམས་ཅད་ཉེར་འཇོམས་བྱེད། །
en: They are alluring, stand on pretas, And destroy all delusion.

source: ཆོས་འཁོར་ཨ་ཤྭཏྠའི་དབྱུག་པ། །དེ་བཞིན་ཡིད་བཞིན་ནོར་བུའི་ཤིང་། །
en: “They are to be drawn in the midst of a Dharma wheel, An aśvattha sprig, and a wish-fulfilling tree.

source: ལྷ་མོ་རྣམས་ཀྱི་ཕྱག་གཡས་སུ། །རྡོ་རྗེ་ཡང་ནི་བསྒོམ་པར་བྱ། །
en: A vajra should be visualized In the goddesses’ right hands.

source: ཆོས་ཀྱི་འཁོར་ལོ་ཐམས་ཅད་ལ། །
en: They should be visualized on a circular disk, With a human skull in their other hand.

source: ཐོད་པའི་སྣོད་ནི་གཡོན་པ་ལ། །སྤྱན་མ་མཱ་མ་ཀཱི་སྒྲོལ་མ། །གོས་དཀར་ཡིད་དུ་འོང་བ་རྣམས། །མེ་ལ་སོགས་པའི་མཚམས་བཞི་རུ། །འཁོར་ལོ་ཕྱི་རོལ་གཤིན་གཤེད་དོ། །
en: “The enchanting Locanā, Māmakī, Tārā, and Pāṇḍarā Are in the four corners, beginning in the southeast, And Yamāntaka is in the outer circle.

source: ཤེས་རབ་མཐར་བྱེད་རྟ་མགྲིན་དང་། །འཁྱིལ་བར་བཅས་པ་བསྒོམ་པར་བྱ། །འཁོར་ལོ་ཡི་ནི་སྒོ་སྲུངས་ཏེ། །
en: One should visualize Prajñāntaka, Hayagrīva, Sarvakuṇḍali, And the maṇḍala’s door guardians as well, Imagining them following the proper rite.”

source: ཆོ་གའི་ལས་ནི་མཐོང་བས་སོ། །གཤིན་རྗེའི་གཤེད་ནག་པོའི་རྒྱུད་ལས་ཧེ་རུ་ཀ་བསྒྲུབ་པའི་རིམ་པར་ཕྱེ་བ་སྟེ་བཅུ་དྲུག་པའོ།། །།
en: This was the sixteenth chapter, “The Practice of Heruka,” from The Tantra of Black Yamāri, the Body, Speech, and Mind of All Tathāgatas.

source: རྣམ་པ་ལྔ་ནི་བསྒོམས་བྱས་ལ། །སངས་རྒྱས་གཟུགས་ནི་བསྒོམ་པར་བྱ། །
en: Chapter 17: Bodhicitta “After visualizing the five aspects, The adept should visualize an image of the Buddha.

source: སངས་རྒྱས་གཟུགས་ནི་བསྒོམ་པ་ཡིས། །མཁས་པས་འཁོར་ལོ་བསྒོམ་པར་བྱ། །
en: After visualizing the image of the Buddha, They should visualize the wheel bearer.

source: གྲུ་བཞི་ཡི་ནི་སྦྱོར་བ་ཡིས། །འཁོར་ལོ་བསྐྱེད་པར་བྱ་བ་སྟེ། །
en: “The performance of the four songs Initiates the emergence of the wheel bearer.

source: ཙརྩི་ཀཱ་སོགས་གླུ་དང་ནི། །དྲུག་པ་སྐྱེས་སོགས་ལེན་པར་བྱེད། །
en: Cārcikā and the others offer songs In the ṣāḍava and other scales.

source: སྙིང་རྗེ་ཁྲོས་པའི་དད་སྒྲོལ་བཞེངས། །ཁམས་གསུམ་ཀུན་གྱི་གཏི་མུག་སོལ། །
en: “ ‘Rise, lord of compassionate wrath, And remove the ignorance of the three worlds!’

source: དད་སྒྲོལ་གསོལ་བས་མ་བཞུགས་བཞེངས། །བདུད་འདི་དག་ལས་རྒྱལ་བར་མཛོད། །
en: “ ‘I beg you, Lord, do not linger but rise, Be victorious over the māras!’

source: འཇིག་རྟེན་མགོན་པོ་སྟོང་ཉིད་ཇི་སྟེ་བཞུགས། །
en: “ ‘World protector, how can you dwell in emptiness?

source: དད་སྒྲོལ་འཇིག་རྟེན་བསོད་ནམས་ཀྱིས་བཞེངས་ཤིག །
en: Arise, Lord, through the power of the world’s merit!’ “ ‘Why do you remain in emptiness?

source: བྱང་ཆུབ་འདོད་པའི་འཇིག་རྟེན་མགྲོན་བོས་ནས། །ཁྱོད་ནི་སྟོང་པ་ཉིད་ལ་སེམས་པར་བྱེད། །
en: The world moves toward the nature of awakening.’

source: ཇི་ལྟར་སྐར་མདའ་འཕོ་བ་བཞིན། །བྱང་ཆུབ་སེམས་ལ་ཞུགས་པར་གྱུར། །
en: “Bodhicitta should be reached, Like the trajectory of a shooting star.

source: རྡོ་རྗེ་འཆང་རང་ངོ་བོ་ཉིད། །སྙིང་རྗེ་དང་ནི་འདོད་ཆགས་སེམས། །
en: The vajra holder himself has melted, Through a mind suffused with compassion.

source: དང་པོར་བསྒོམ་པ་རྣལ་འབྱོར་ཏེ། །གཉིས་པ་རྗེས་ཀྱི་རྣལ་འབྱོར་ཡིན། །གསུམ་པ་ཤིན་ཏུ་རྣལ་འབྱོར་ཏེ། །བཞི་པ་རྣལ་འབྱོར་ཆེན་པོའོ། །
en: “First one should cultivate yoga, Second, anuyoga, Third, atiyoga, And fourth, mahāyoga.

source: རྡོ་རྗེ་སེམས་དཔའ་རྫོགས་པ་ཡིན། །རྣལ་འབྱོར་ཡིན་པར་འདི་ལྟར་འདོད། །
en: “The completion of Vajrasattva Is what is meant by yoga.

source: དེ་ནི་རྒྱུ་མཐུན་ལྷ་ཡི་སྐུ། །རྗེས་ཀྱི་རྣལ་འབྱོར་ཡིན་པར་གྲགས། །
en: The melting of the deity’s body Is known as anuyoga.
